In [10]:
import pandas as pd
import numpy as np

In [11]:
df=pd.DataFrame({
    'col1': [1,2,3,4,5],
    'col2': [45,56,89, 90, 10],
    'col3': "jissmon jose ineuron data science".split()
})

In [12]:
df

   col1  col2     col3
0     1    45  jissmon
1     2    56     jose
2     3    89  ineuron
3     4    90     data
4     5    10  science

In [20]:
# create new column with values of square of col1.
# use np.square()

In [21]:
df['col4'] = np.square(df['col1'])

In [22]:
df

   col1  col2     col3  col4
0     1    45  jissmon     1
1     2    56     jose     4
2     3    89  ineuron     9
3     4    90     data    16
4     5    10  science    25

### using apply() method

In [23]:
# create column 5 that hold first characters of col3

In [25]:
fn1 = lambda x: x[0]
df['col5'] = df['col3'].apply(fn1)

In [26]:
df

   col1  col2     col3  col4 col5
0     1    45  jissmon     1    j
1     2    56     jose     4    j
2     3    89  ineuron     9    i
3     4    90     data    16    d
4     5    10  science    25    s

In [27]:
# create column 6 holding complex functions

In [33]:
def fun3(x):
    for i in x[0]:
        if i == 'j':
            return i
        else:
            return 'z'

df['col6'] = df['col3'].apply(fun3)

In [34]:
df['col6']

0    j
1    j
2    z
3    z
4    z
Name: col6, dtype: object

In [35]:
df

   col1  col2     col3  col4 col5 col6
0     1    45  jissmon     1    j    j
1     2    56     jose     4    j    j
2     3    89  ineuron     9    i    z
3     4    90     data    16    d    z
4     5    10  science    25    s    z

In [36]:
# convert col3 to upper case

In [38]:
df['col8'] = df['col3'].map(str.upper)

In [39]:
# create column col7 where we hold data

In [40]:
# create col9 which hold logarithmic of col2

In [42]:
df['col9'] = np.log(df['col2'])

In [43]:
df['col9']

0    3.806662
1    4.025352
2    4.488636
3    4.499810
4    2.302585
Name: col9, dtype: float64

In [44]:
df

   col1  col2     col3  col4 col5 col6     col8      col9
0     1    45  jissmon     1    j    j  JISSMON  3.806662
1     2    56     jose     4    j    j     JOSE  4.025352
2     3    89  ineuron     9    i    z  INEURON  4.488636
3     4    90     data    16    d    z     DATA  4.499810
4     5    10  science    25    s    z  SCIENCE  2.302585

In [56]:
df['col8'][0][0::2]

'JSMN'

In [61]:
df['col10'] = df['col8'].apply(lambda a: a[0::2])

In [62]:
df

   col1  col2     col3  col4 col5 col6     col8      col9 col10
0     1    45  jissmon     1    j    j  JISSMON  3.806662  JSMN
1     2    56     jose     4    j    j     JOSE  4.025352    JS
2     3    89  ineuron     9    i    z  INEURON  4.488636  IERN
3     4    90     data    16    d    z     DATA  4.499810    DT
4     5    10  science    25    s    z  SCIENCE  2.302585  SINE